MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2020/mcu.h
#define _INTCON2_INT0EP_POSITION                 0x00000000
#define _INTCON2_INT0EP_MASK                     0x00000001
#define _INTCON2_INT0EP_LENGTH                   0x00000001

#define _INTCON2_INT1EP_POSITION                 0x00000001
#define _INTCON2_INT1EP_MASK                     0x00000002
#define _INTCON2_INT1EP_LENGTH                   0x00000001

#define _INTCON2_INT2EP_POSITION                 0x00000002
#define _INTCON2_INT2EP_MASK                     0x00000004
#define _INTCON2_INT2EP_LENGTH                   0x00000001

#define _INTCON2_DISI_POSITION                   0x0000000E
#define _INTCON2_DISI_MASK                       0x00004000
#define _INTCON2_DISI_LENGTH                     0x00000001

#define _INTCON2_ALTIVT_POSITION                 0x0000000F
#define _INTCON2_ALTIVT_MASK                     0x00008000
#define _INTCON2_ALTIVT_LENGTH                   0x00000001

#define _IFS0_INT0IF_POSITION                    0x00000000
#define _IFS0_INT0IF_MASK                        0x00000001
#define _IFS0_INT0IF_LENGTH                      0x00000001

#define _IFS0_IC1IF_POSITION                     0x00000001
#define _IFS0_IC1IF_MASK                         0x00000002
#define _IFS0_IC1IF_LENGTH                       0x00000001

#define _IFS0_OC1IF_POSITION                     0x00000002
#define _IFS0_OC1IF_MASK                         0x00000004
#define _IFS0_OC1IF_LENGTH                       0x00000001

#define _IFS0_T1IF_POSITION                      0x00000003
#define _IFS0_T1IF_MASK                          0x00000008
#define _IFS0_T1IF_LENGTH                        0x00000001

#define _IFS0_OC2IF_POSITION                     0x00000005
#define _IFS0_OC2IF_MASK                         0x00000020
#define _IFS0_OC2IF_LENGTH                       0x00000001

#define _IFS0_T2IF_POSITION                      0x00000006
#define _IFS0_T2IF_MASK                          0x00000040
#define _IFS0_T2IF_LENGTH                        0x00000001

#define _IFS0_T3IF_POSITION                      0x00000007
#define _IFS0_T3IF_MASK                          0x00000080
#define _IFS0_T3IF_LENGTH                        0x00000001

#define _IFS0_SPI1IF_POSITION                    0x00000008
#define _IFS0_SPI1IF_MASK                        0x00000100
#define _IFS0_SPI1IF_LENGTH                      0x00000001

#define _IFS0_U1RXIF_POSITION                    0x00000009
#define _IFS0_U1RXIF_MASK                        0x00000200
#define _IFS0_U1RXIF_LENGTH                      0x00000001

#define _IFS0_U1TXIF_POSITION                    0x0000000A
#define _IFS0_U1TXIF_MASK                        0x00000400
#define _IFS0_U1TXIF_LENGTH                      0x00000001

#define _IFS0_ADIF_POSITION                      0x0000000B
#define _IFS0_ADIF_MASK                          0x00000800
#define _IFS0_ADIF_LENGTH                        0x00000001

#define _IFS0_NVMIF_POSITION                     0x0000000C
#define _IFS0_NVMIF_MASK                         0x00001000
#define _IFS0_NVMIF_LENGTH                       0x00000001

#define _IFS0_SI2CIF_POSITION                    0x0000000D
#define _IFS0_SI2CIF_MASK                        0x00002000
#define _IFS0_SI2CIF_LENGTH                      0x00000001

#define _IFS0_MI2CIF_POSITION                    0x0000000E
#define _IFS0_MI2CIF_MASK                        0x00004000
#define _IFS0_MI2CIF_LENGTH                      0x00000001

#define _IFS1_INT1IF_POSITION                    0x00000000
#define _IFS1_INT1IF_MASK                        0x00000001
#define _IFS1_INT1IF_LENGTH                      0x00000001

#define _IFS1_INT2IF_POSITION                    0x00000001
#define _IFS1_INT2IF_MASK                        0x00000002
#define _IFS1_INT2IF_LENGTH                      0x00000001

#define _IFS1_PSEMIF_POSITION                    0x00000002
#define _IFS1_PSEMIF_MASK                        0x00000004
#define _IFS1_PSEMIF_LENGTH                      0x00000001

#define _IFS1_PWM1IF_POSITION                    0x00000003
#define _IFS1_PWM1IF_MASK                        0x00000008
#define _IFS1_PWM1IF_LENGTH                      0x00000001

#define _IFS1_PWM2IF_POSITION                    0x00000004
#define _IFS1_PWM2IF_MASK                        0x00000010
#define _IFS1_PWM2IF_LENGTH                      0x00000001

#define _IFS1_PWM3IF_POSITION                    0x00000005
#define _IFS1_PWM3IF_MASK                        0x00000020
#define _IFS1_PWM3IF_LENGTH                      0x00000001

#define _IFS1_PWM4IF_POSITION                    0x00000006
#define _IFS1_PWM4IF_MASK                        0x00000040
#define _IFS1_PWM4IF_LENGTH                      0x00000001

#define _IFS1_CNIF_POSITION                      0x0000000B
#define _IFS1_CNIF_MASK                          0x00000800
#define _IFS1_CNIF_LENGTH                        0x00000001

#define _IFS1_AC1IF_POSITION                     0x0000000D
#define _IFS1_AC1IF_MASK                         0x00002000
#define _IFS1_AC1IF_LENGTH                       0x00000001

#define _IFS1_AC2IF_POSITION                     0x0000000E
#define _IFS1_AC2IF_MASK                         0x00004000
#define _IFS1_AC2IF_LENGTH                       0x00000001

#define _IFS1_AC3IF_POSITION                     0x0000000F
#define _IFS1_AC3IF_MASK                         0x00008000
#define _IFS1_AC3IF_LENGTH                       0x00000001

#define _IFS1_PWMEVIF_POSITION                   0x00000002
#define _IFS1_PWMEVIF_MASK                       0x00000004
#define _IFS1_PWMEVIF_LENGTH                     0x00000001

#define _IFS2_AC4IF_POSITION                     0x00000000
#define _IFS2_AC4IF_MASK                         0x00000001
#define _IFS2_AC4IF_LENGTH                       0x00000001

#define _IFS2_ADCP0IF_POSITION                   0x00000005
#define _IFS2_ADCP0IF_MASK                       0x00000020
#define _IFS2_ADCP0IF_LENGTH                     0x00000001

#define _IFS2_ADCP1IF_POSITION                   0x00000006
#define _IFS2_ADCP1IF_MASK                       0x00000040
#define _IFS2_ADCP1IF_LENGTH                     0x00000001

