MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2020/mcu.h
#define _IFS2_ADCP2IF_POSITION                   0x00000007
#define _IFS2_ADCP2IF_MASK                       0x00000080
#define _IFS2_ADCP2IF_LENGTH                     0x00000001

#define _IFS2_ADCP3IF_POSITION                   0x00000008
#define _IFS2_ADCP3IF_MASK                       0x00000100
#define _IFS2_ADCP3IF_LENGTH                     0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000000
#define _IEC0_INT0IE_MASK                        0x00000001
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000001
#define _IEC0_IC1IE_MASK                         0x00000002
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000002
#define _IEC0_OC1IE_MASK                         0x00000004
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_T1IE_POSITION                      0x00000003
#define _IEC0_T1IE_MASK                          0x00000008
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_OC2IE_POSITION                     0x00000005
#define _IEC0_OC2IE_MASK                         0x00000020
#define _IEC0_OC2IE_LENGTH                       0x00000001

#define _IEC0_T2IE_POSITION                      0x00000006
#define _IEC0_T2IE_MASK                          0x00000040
#define _IEC0_T2IE_LENGTH                        0x00000001

#define _IEC0_T3IE_POSITION                      0x00000007
#define _IEC0_T3IE_MASK                          0x00000080
#define _IEC0_T3IE_LENGTH                        0x00000001

#define _IEC0_SPI1IE_POSITION                    0x00000008
#define _IEC0_SPI1IE_MASK                        0x00000100
#define _IEC0_SPI1IE_LENGTH                      0x00000001

#define _IEC0_U1RXIE_POSITION                    0x00000009
#define _IEC0_U1RXIE_MASK                        0x00000200
#define _IEC0_U1RXIE_LENGTH                      0x00000001

#define _IEC0_U1TXIE_POSITION                    0x0000000A
#define _IEC0_U1TXIE_MASK                        0x00000400
#define _IEC0_U1TXIE_LENGTH                      0x00000001

#define _IEC0_ADIE_POSITION                      0x0000000B
#define _IEC0_ADIE_MASK                          0x00000800
#define _IEC0_ADIE_LENGTH                        0x00000001

#define _IEC0_NVMIE_POSITION                     0x0000000C
#define _IEC0_NVMIE_MASK                         0x00001000
#define _IEC0_NVMIE_LENGTH                       0x00000001

#define _IEC0_SI2CIE_POSITION                    0x0000000D
#define _IEC0_SI2CIE_MASK                        0x00002000
#define _IEC0_SI2CIE_LENGTH                      0x00000001

#define _IEC0_MI2CIE_POSITION                    0x0000000E
#define _IEC0_MI2CIE_MASK                        0x00004000
#define _IEC0_MI2CIE_LENGTH                      0x00000001

#define _IEC1_INT1IE_POSITION                    0x00000000
#define _IEC1_INT1IE_MASK                        0x00000001
#define _IEC1_INT1IE_LENGTH                      0x00000001

#define _IEC1_INT2IE_POSITION                    0x00000001
#define _IEC1_INT2IE_MASK                        0x00000002
#define _IEC1_INT2IE_LENGTH                      0x00000001

#define _IEC1_PSEMIE_POSITION                    0x00000002
#define _IEC1_PSEMIE_MASK                        0x00000004
#define _IEC1_PSEMIE_LENGTH                      0x00000001

#define _IEC1_PWM1IE_POSITION                    0x00000003
#define _IEC1_PWM1IE_MASK                        0x00000008
#define _IEC1_PWM1IE_LENGTH                      0x00000001

#define _IEC1_PWM2IE_POSITION                    0x00000004
#define _IEC1_PWM2IE_MASK                        0x00000010
#define _IEC1_PWM2IE_LENGTH                      0x00000001

#define _IEC1_PWM3IE_POSITION                    0x00000005
#define _IEC1_PWM3IE_MASK                        0x00000020
#define _IEC1_PWM3IE_LENGTH                      0x00000001

#define _IEC1_PWM4IE_POSITION                    0x00000006
#define _IEC1_PWM4IE_MASK                        0x00000040
#define _IEC1_PWM4IE_LENGTH                      0x00000001

#define _IEC1_CNIE_POSITION                      0x0000000B
#define _IEC1_CNIE_MASK                          0x00000800
#define _IEC1_CNIE_LENGTH                        0x00000001

#define _IEC1_AC1IE_POSITION                     0x0000000D
#define _IEC1_AC1IE_MASK                         0x00002000
#define _IEC1_AC1IE_LENGTH                       0x00000001

#define _IEC1_AC2IE_POSITION                     0x0000000E
#define _IEC1_AC2IE_MASK                         0x00004000
#define _IEC1_AC2IE_LENGTH                       0x00000001

#define _IEC1_AC3IE_POSITION                     0x0000000F
#define _IEC1_AC3IE_MASK                         0x00008000
#define _IEC1_AC3IE_LENGTH                       0x00000001

#define _IEC1_PWMEVIE_POSITION                   0x00000002
#define _IEC1_PWMEVIE_MASK                       0x00000004
#define _IEC1_PWMEVIE_LENGTH                     0x00000001

#define _IEC2_AC4IE_POSITION                     0x00000000
#define _IEC2_AC4IE_MASK                         0x00000001
#define _IEC2_AC4IE_LENGTH                       0x00000001

#define _IEC2_ADCP0IE_POSITION                   0x00000005
#define _IEC2_ADCP0IE_MASK                       0x00000020
#define _IEC2_ADCP0IE_LENGTH                     0x00000001

#define _IEC2_ADCP1IE_POSITION                   0x00000006
#define _IEC2_ADCP1IE_MASK                       0x00000040
#define _IEC2_ADCP1IE_LENGTH                     0x00000001

#define _IEC2_ADCP2IE_POSITION                   0x00000007
#define _IEC2_ADCP2IE_MASK                       0x00000080
#define _IEC2_ADCP2IE_LENGTH                     0x00000001

#define _IEC2_ADCP3IE_POSITION                   0x00000008
#define _IEC2_ADCP3IE_MASK                       0x00000100
#define _IEC2_ADCP3IE_LENGTH                     0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_IC1IP_POSITION                     0x00000004
#define _IPC0_IC1IP_MASK                         0x00000070
#define _IPC0_IC1IP_LENGTH                       0x00000003

#define _IPC0_OC1IP_POSITION                     0x00000008
#define _IPC0_OC1IP_MASK                         0x00000700
#define _IPC0_OC1IP_LENGTH                       0x00000003

#define _IPC0_T1IP_POSITION                      0x0000000C
#define _IPC0_T1IP_MASK                          0x00007000
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_INT0IP0_POSITION                   0x00000000
#define _IPC0_INT0IP0_MASK                       0x00000001
#define _IPC0_INT0IP0_LENGTH                     0x00000001

#define _IPC0_INT0IP1_POSITION                   0x00000001
#define _IPC0_INT0IP1_MASK                       0x00000002
#define _IPC0_INT0IP1_LENGTH                     0x00000001

