MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2020/mcu.h
#define _OSCTUN2_TSEQ41_POSITION                 0x00000001
#define _OSCTUN2_TSEQ41_MASK                     0x00000002
#define _OSCTUN2_TSEQ41_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ42_POSITION                 0x00000002
#define _OSCTUN2_TSEQ42_MASK                     0x00000004
#define _OSCTUN2_TSEQ42_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ43_POSITION                 0x00000003
#define _OSCTUN2_TSEQ43_MASK                     0x00000008
#define _OSCTUN2_TSEQ43_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ50_POSITION                 0x00000004
#define _OSCTUN2_TSEQ50_MASK                     0x00000010
#define _OSCTUN2_TSEQ50_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ51_POSITION                 0x00000005
#define _OSCTUN2_TSEQ51_MASK                     0x00000020
#define _OSCTUN2_TSEQ51_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ52_POSITION                 0x00000006
#define _OSCTUN2_TSEQ52_MASK                     0x00000040
#define _OSCTUN2_TSEQ52_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ53_POSITION                 0x00000007
#define _OSCTUN2_TSEQ53_MASK                     0x00000080
#define _OSCTUN2_TSEQ53_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ60_POSITION                 0x00000008
#define _OSCTUN2_TSEQ60_MASK                     0x00000100
#define _OSCTUN2_TSEQ60_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ61_POSITION                 0x00000009
#define _OSCTUN2_TSEQ61_MASK                     0x00000200
#define _OSCTUN2_TSEQ61_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ62_POSITION                 0x0000000A
#define _OSCTUN2_TSEQ62_MASK                     0x00000400
#define _OSCTUN2_TSEQ62_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ63_POSITION                 0x0000000B
#define _OSCTUN2_TSEQ63_MASK                     0x00000800
#define _OSCTUN2_TSEQ63_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ70_POSITION                 0x0000000C
#define _OSCTUN2_TSEQ70_MASK                     0x00001000
#define _OSCTUN2_TSEQ70_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ71_POSITION                 0x0000000D
#define _OSCTUN2_TSEQ71_MASK                     0x00002000
#define _OSCTUN2_TSEQ71_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ72_POSITION                 0x0000000E
#define _OSCTUN2_TSEQ72_MASK                     0x00004000
#define _OSCTUN2_TSEQ72_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ73_POSITION                 0x0000000F
#define _OSCTUN2_TSEQ73_MASK                     0x00008000
#define _OSCTUN2_TSEQ73_LENGTH                   0x00000001

#define _BSRAM_RL_BSR_POSITION                   0x00000000
#define _BSRAM_RL_BSR_MASK                       0x00000001
#define _BSRAM_RL_BSR_LENGTH                     0x00000001

#define _BSRAM_IR_BSR_POSITION                   0x00000001
#define _BSRAM_IR_BSR_MASK                       0x00000002
#define _BSRAM_IR_BSR_LENGTH                     0x00000001

#define _BSRAM_IW_BSR_POSITION                   0x00000002
#define _BSRAM_IW_BSR_MASK                       0x00000004
#define _BSRAM_IW_BSR_LENGTH                     0x00000001

#define _NVMCON_PROGOP_POSITION                  0x00000000
#define _NVMCON_PROGOP_MASK                      0x0000007F
#define _NVMCON_PROGOP_LENGTH                    0x00000007

#define _NVMCON_TWRI_POSITION                    0x00000008
#define _NVMCON_TWRI_MASK                        0x00000100
#define _NVMCON_TWRI_LENGTH                      0x00000001

#define _NVMCON_WRERR_POSITION                   0x0000000D
#define _NVMCON_WRERR_MASK                       0x00002000
#define _NVMCON_WRERR_LENGTH                     0x00000001

#define _NVMCON_WREN_POSITION                    0x0000000E
#define _NVMCON_WREN_MASK                        0x00004000
#define _NVMCON_WREN_LENGTH                      0x00000001

#define _NVMCON_WR_POSITION                      0x0000000F
#define _NVMCON_WR_MASK                          0x00008000
#define _NVMCON_WR_LENGTH                        0x00000001

#define _NVMCON_PROGOP0_POSITION                 0x00000000
#define _NVMCON_PROGOP0_MASK                     0x00000001
#define _NVMCON_PROGOP0_LENGTH                   0x00000001

#define _NVMCON_PROGOP1_POSITION                 0x00000001
#define _NVMCON_PROGOP1_MASK                     0x00000002
#define _NVMCON_PROGOP1_LENGTH                   0x00000001

#define _NVMCON_PROGOP2_POSITION                 0x00000002
#define _NVMCON_PROGOP2_MASK                     0x00000004
#define _NVMCON_PROGOP2_LENGTH                   0x00000001

#define _NVMCON_PROGOP3_POSITION                 0x00000003
#define _NVMCON_PROGOP3_MASK                     0x00000008
#define _NVMCON_PROGOP3_LENGTH                   0x00000001

#define _NVMCON_PROGOP4_POSITION                 0x00000004
#define _NVMCON_PROGOP4_MASK                     0x00000010
#define _NVMCON_PROGOP4_LENGTH                   0x00000001

#define _NVMCON_PROGOP5_POSITION                 0x00000005
#define _NVMCON_PROGOP5_MASK                     0x00000020
#define _NVMCON_PROGOP5_LENGTH                   0x00000001

#define _NVMCON_PROGOP6_POSITION                 0x00000006
#define _NVMCON_PROGOP6_MASK                     0x00000040
#define _NVMCON_PROGOP6_LENGTH                   0x00000001

#define _NVMADRU_NVMADR_POSITION                 0x00000000
#define _NVMADRU_NVMADR_MASK                     0x000000FF
#define _NVMADRU_NVMADR_LENGTH                   0x00000008

#define _NVMKEY_NVMKEY_POSITION                  0x00000000
#define _NVMKEY_NVMKEY_MASK                      0x000000FF
#define _NVMKEY_NVMKEY_LENGTH                    0x00000008

#define _PMD1_ADCMD_POSITION                     0x00000000
#define _PMD1_ADCMD_MASK                         0x00000001
#define _PMD1_ADCMD_LENGTH                       0x00000001

#define _PMD1_SPI1MD_POSITION                    0x00000003
#define _PMD1_SPI1MD_MASK                        0x00000008
#define _PMD1_SPI1MD_LENGTH                      0x00000001

