MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2020/mcu.h
#define _PMD1_U1MD_POSITION                      0x00000005
#define _PMD1_U1MD_MASK                          0x00000020
#define _PMD1_U1MD_LENGTH                        0x00000001

#define _PMD1_I2CMD_POSITION                     0x00000007
#define _PMD1_I2CMD_MASK                         0x00000080
#define _PMD1_I2CMD_LENGTH                       0x00000001

#define _PMD1_PWMMD_POSITION                     0x00000009
#define _PMD1_PWMMD_MASK                         0x00000200
#define _PMD1_PWMMD_LENGTH                       0x00000001

#define _PMD1_T1MD_POSITION                      0x0000000B
#define _PMD1_T1MD_MASK                          0x00000800
#define _PMD1_T1MD_LENGTH                        0x00000001

#define _PMD1_T2MD_POSITION                      0x0000000C
#define _PMD1_T2MD_MASK                          0x00001000
#define _PMD1_T2MD_LENGTH                        0x00000001

#define _PMD1_T3MD_POSITION                      0x0000000D
#define _PMD1_T3MD_MASK                          0x00002000
#define _PMD1_T3MD_LENGTH                        0x00000001

#define _PMD2_OC1MD_POSITION                     0x00000000
#define _PMD2_OC1MD_MASK                         0x00000001
#define _PMD2_OC1MD_LENGTH                       0x00000001

#define _PMD2_OC2MD_POSITION                     0x00000001
#define _PMD2_OC2MD_MASK                         0x00000002
#define _PMD2_OC2MD_LENGTH                       0x00000001

#define _PMD2_IC1MD_POSITION                     0x00000008
#define _PMD2_IC1MD_MASK                         0x00000100
#define _PMD2_IC1MD_LENGTH                       0x00000001

#define _PMD3_CMP_PSMD_POSITION                  0x0000000B
#define _PMD3_CMP_PSMD_MASK                      0x00000800
#define _PMD3_CMP_PSMD_LENGTH                    0x00000001



/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Register FBS (0xf80000)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBS;
#define _FBS(x) __attribute__((address(0xf80000),deprecated_definition("consider migrating to #pragma config"),section("__FBS.sec"),space(prog))) __prog__ uint16_t _FBS = (x);

/*
** Only one invocation of FBS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBS.
** Multiple options may be combined, as shown:
**
** _FBS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write Protect:
**     BWRP_ON              Boot Segment is write protected
**     WR_PROT_BOOT_ON      Boot Segment is write protected
**     BWRP_OFF             Boot Segment may be written
**     WR_PROT_BOOT_OFF     Boot Segment may be written
**
**   Boot Segment Program Flash Code Protection:
**     HIGH_MEDIUM_BOOT_CODEHigh Security, Medium-sized Boot Flash
**     HIGH_SMALL_BOOT_CODE High Security, Small-sized Boot Flash
**     STRD_MEDIUM_BOOT_CODEStandard Security, Medium-sized Boot Flash
**     STRD_SMALL_BOOT_CODE Standard Security, Small-sized Boot Flash
**     NO_BOOT_CODE         No Boot Segment
**
*/

#define BWRP_ON              0x000E
#define WR_PROT_BOOT_ON      0x000E
#define BWRP_OFF             0x000F
#define WR_PROT_BOOT_OFF     0x000F

#define HIGH_MEDIUM_BOOT_CODE 0x0003
#define HIGH_SMALL_BOOT_CODE 0x0005
#define STRD_MEDIUM_BOOT_CODE 0x000B
#define STRD_SMALL_BOOT_CODE 0x000D
#define NO_BOOT_CODE         0x000F

/* Register FGS (0xf80004)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FGS;
#define _FGS(x) __attribute__((address(0xf80004),deprecated_definition("consider migrating to #pragma config"),section("__FGS.sec"),space(prog))) __prog__ uint16_t _FGS = (x);

/*
** Only one invocation of FGS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FGS.
** Multiple options may be combined, as shown:
**
** _FGS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   General Code Segment Write Protect:
**     GWRP_ON              General Segment is write protected
**     GWRP_OFF             General Segment may be written
**
**   General Segment Code Protection:
**     GSS_HIGH             High Security Code Protection Enabled
**     GSS_ON               Enabled
**     GSS_STD              Enabled
**     CODE_PROT_ON         Enabled
**     GSS_OFF              Disabled
**     CODE_PROT_OFF        Disabled
**
*/

#define GWRP_ON              0x0006
#define GWRP_OFF             0x0007

#define GSS_HIGH             0x0003
#define GSS_ON               0x0005
#define GSS_STD              0x0005
#define CODE_PROT_ON         0x0005
#define GSS_OFF              0x0007
#define CODE_PROT_OFF        0x0007

/* Register FOSCSEL (0xf80006)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSCSEL;
#define _FOSCSEL(x) __attribute__((address(0xf80006),deprecated_definition("consider migrating to #pragma config"),section("__FOSCSEL.sec"),space(prog))) __prog__ uint16_t _FOSCSEL = (x);

/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Oscillator Mode:
**     FRC                  Internal Fast RC (FRC)
**     FRC_PLL              Internal Fast RC (FRC) w/ PLL
**     PRIOSC               Primary Oscillator (HS, EC)
**     PRIOSC_PLL           Primary Oscillator (HS, EC) w/ PLL
**
*/

#define FRC                  0x0000
#define FRC_PLL              0x0001
#define PRIOSC               0x0002
#define PRIOSC_PLL           0x0003

/* Register FOSC (0xf80008)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSC;
#define _FOSC(x) __attribute__((address(0xf80008),deprecated_definition("consider migrating to #pragma config"),section("__FOSC.sec"),space(prog))) __prog__ uint16_t _FOSC = (x);

